{
  "architectures": [
    "SiglipTextModel"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 49406,
  "dtype": "float32",
  "eos_token_id": 49407,
  "hidden_act": "gelu_pytorch_tanh",
  "hidden_size": 1152,
  "intermediate_size": 4304,
  "layer_norm_eps": 1e-06,
  "max_position_embeddings": 64,
  "model_type": "siglip_text_model",
  "num_attention_heads": 16,
  "num_hidden_layers": 27,
  "pad_token_id": 1,
  "projection_size": 1152,
  "transformers_version": "5.10.2",
  "vocab_size": 256000
}
