{
  "backend": "tokenizers",
  "bos_token": "<bos>",
  "clean_up_tokenization_spaces": false,
  "do_lower_case": true,
  "eos_token": "<eos>",
  "is_local": true,
  "local_files_only": true,
  "mask_token": "<mask>",
  "max_length": 64,
  "model_input_names": [
    "input_ids"
  ],
  "model_max_length": 1000000000000000019884624838656,
  "pad_to_multiple_of": null,
  "pad_token": "<pad>",
  "pad_token_type_id": 0,
  "padding_side": "right",
  "processor_class": "SiglipProcessor",
  "sp_model_kwargs": {},
  "spaces_between_special_tokens": false,
  "tokenizer_class": "GemmaTokenizer",
  "unk_token": "<unk>",
  "use_default_system_prompt": false
}
